package task_B;

import task_B.Song;

import java.io.FileNotFoundException;
import java.io.FileReader;
import java.io.FileWriter;
import java.io.IOException;
import java.util.Scanner;

public class MainB {

    public static void main(String[] args) throws IOException {
        Song song = new Song("Kyz", "Zere", "Pop", "");

        FileWriter fileWriter = new FileWriter("src/task_B/kyz.txt");
        fileWriter.write("Автор песни: Зере;\n");
        fileWriter.write("Название песни: Кыз;\n");
        fileWriter.write("Жанр: Поп-музыка;\n");
        fileWriter.write("Текст песни:\n" +
                "    Убакыт келсе, заман өтсө\n" +
                "    Кандай өмүр сүрөм үйрөтпөсө\n" +
                "    \"Мындай кыл сен, андай кылба\"\n" +
                "    Деген сөздөр айтылбаса\n" +
                "    Неге болом сен айткандай\n" +
                "    Же көпчүлүк калаагандай?\n" +
                "    Адам болгонум, сөз эркиндигим\n" +
                "    Кана сыйың мага карай?\n" +
                "    Сени сыйлайм, мени сыйла\n" +
                "    Сени менен мен экөөбүз\n" +
                "    Келсең жаным, кошул мага\n" +
                "    өз эркиндигибизди биз\n" +
                "    Жаратабыз айланада\n" +
                "    Сени менен мен экөөбүз\n" +
                "    Келсең жаным, кошул мага\n" +
                "    өз эркиндигибизди биз\n" +
                "    Жаратабыз...\n" +
                "    Убакыт келет, заман өтөт\n" +
                "    Эч ким мага антип сүйлөбөйт\n" +
                "    \"Муну кийбе аны кылба\"\n" +
                "    Сен мага антип кыйкырба!\n" +
                "    Неге болом сен айткандай\n" +
                "    Же көпчүлүк калаагандай?\n" +
                "    Адам болгонум, сөз эркиндигим\n" +
                "    Кана сыйың мага карай\n" +
                "    Сени сыйлайм, мени сыйла\n" +
                "    Сени менен мен экөөбүз\n" +
                "    Келсең жаным, кошул мага\n" +
                "    Өз эркиндигибизди биз\n" +
                "    Жаратабыз айланада\n" +
                "    Сени менен мен экөөбүз\n" +
                "    Келсең жаным, кошул мага\n" +
                "    өз эркиндигибизди биз\n" +
                "    Жаратабыз айланада\n" +
                "    Эч бирибиз өзун кем сезбесин\n" +
                "    Эч бир нерседен сен кем эмессиң\n" +
                "    Сени менен мен экөөбүз\n" +
                "    Келсең жаным, кошул мага\n" +
                "    өз эркиндигибизди биз\n" +
                "    Жаратабыз айланада\n" +
                "    Сени менен мен экөөбүз\n" +
                "    Келсең жаным, кошул мага\n" +
                "    өз эркиндигибизди биз\n" +
                "    Жаратабыз айланада");
        fileWriter.close();

        FileReader fileReader = new FileReader("kyz.txt");
        Scanner sc = new Scanner(fileReader);

        while (sc.hasNextLine()) {
            System.out.println(sc.nextLine());
        }
        fileReader.close();


    }
}
